VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
    EDMA_SetChannelMux(LINK_DMA, channel, request_source);
    EDMA_InstallTCD(LINK_DMA, channel, &tcd[0]);
}

static void link_dma_init(void)
{
    CLOCK_EnableClock(kCLOCK_Dma0);

    // Vendor defaults, taken deliberately rather than by omission. Two of them
    // are behaviourally significant here:
    //
    //   enableHaltOnError = true   any channel error sets HALT and stops the
    //                              whole controller until it is cleared, so a
    //                              fault on one direction takes the other down
    //                              with it. That is the right default for a
    //                              link whose two directions are halves of one
    //                              slot -- a half-dead link returning stale
    //                              bytes is worse than a stopped one -- but it
    //                              means step 3's recovery ladder has to clear
    //                              HALT, not just re-arm ERQ.
    //   enableDebugMode = false    the eDMA keeps running while the core is
    //                              halted in the debugger. Worth knowing for
    //                              step 3, which provokes ERR051588 by halting
    //                              the core while the FPGA clocks SCK: the
    //                              rings are self-loading, so a plain halt does
    //                              not by itself starve the TX FIFO.
    edma_config_t config;
    EDMA_GetDefaultConfig(&config);
    EDMA_Init(LINK_DMA, &config);

    link_dma_rings_install();
}

// Build (or rebuild) both rings and install each channel's first descriptor.
// Split out of link_dma_init() because design doc section 4's recovery rung 4
// is "rewrite both TCD rings": after an ERR051588 the descriptors are rebuilt
// from scratch here rather than the channel being nudged, so there is exactly
// one expression of the ring's geometry and the recovery cannot drift from the
// boot path.
static void link_dma_rings_install(void)
{
    link_dma_ring_init(LINK_DMA_CHANNEL_TX, s_tx_tcd, s_tx_bank, &LINK_SPI->TDR, true,
                       (int32_t)kDma0RequestMuxLpFlexcomm6Tx, 0u);
    link_dma_ring_init(LINK_DMA_CHANNEL_RX, s_rx_tcd, s_rx_bank, &LINK_SPI->RDR, false,
                       (int32_t)kDma0RequestMuxLpFlexcomm6Rx,
                       (uint16_t)kEDMA_MajorInterruptEnable);

    // Both channels restart at descriptor 0, so the retirement cursor does
    // too. This is the one place software state about the ring position is
    // set, and it is set from the same call that decides the hardware's.
    s_rx_cursor = 0u;
}


// ---- WIRE PROBE -- retained deliberately ----
// Sample the four FC6 pins as plain GPIO inputs before LPSPI claims them.
// The FPGA drives SCK, CS and MOSI continuously at 8 kHz whatever the byte
// order or the MISO/MOSI orientation, so a pin that never changes state is a
// wire that is not connected. This separates "LPSPI is misconfigured" from
// "the signal never arrives", which no register dump on this side can do.
static void link_wire_probe(void)
{
    CLOCK_EnableClock(kCLOCK_Port3);
    CLOCK_EnableClock(kCLOCK_Gpio3);  // PDIR reads 0 forever without this
    const uint32_t pins[4] = {20u, 21u, 22u, 23u};
    for (uint32_t i = 0u; i < 4u; ++i) {
        PORT_SetPinMux(PORT3, pins[i], kPORT_MuxAlt0);
        PORT3->PCR[pins[i]] |= PORT_PCR_IBE_MASK;
        GPIO3->PDDR &= ~(1uL << pins[i]);  // input
    }

    uint32_t saw_hi = 0u;
    uint32_t saw_lo = 0u;
    for (uint32_t n = 0u; n < 400000u; ++n) {
        uint32_t v = GPIO3->PDIR;
        saw_hi |= v;
        saw_lo |= ~v;
    }

    dbg_puts("-- WIRE PROBE (FPGA drives these at 8 kHz) --\n");
    for (uint32_t i = 0u; i < 4u; ++i) {
        uint32_t m = 1uL << pins[i];
        dbg_puts("  P3_");
        dbg_putc((char)('0' + (pins[i] / 10u)));
        dbg_putc((char)('0' + (pins[i] % 10u)));
        dbg_puts(" : ");
        if (((saw_hi & m) != 0u) && ((saw_lo & m) != 0u)) {
            dbg_puts("TOGGLING  <- wire alive\n");
        } else if ((saw_hi & m) != 0u) {
            dbg_puts("stuck HIGH\n");
        } else {
            dbg_puts("stuck LOW\n");
        }
    }
    dbg_puts("  (SCK=P3_21 and CS=P3_23 MUST toggle)\n");

    // Self-test: does this probe's input path work at all? Drive each pin with
    // the internal pull-up, then the pull-down, and read it back. A pin that
    // follows its own pull is wired to nothing; a pin that IGNORES the pull is
    // being held by something external. A probe that is simply broken reads the
    // same both ways -- which is how we tell "all four dead" apart from "the
    // probe reads zero".
    dbg_puts("-- probe self-test (pull-up / pull-down) --\n");
    for (uint32_t i = 0u; i < 4u; ++i) {
        uint32_t pin = pins[i];
        uint32_t m = 1uL << pin;

        PORT3->PCR[pin] = (PORT3->PCR[pin] & ~(uint32_t)PORT_PCR_PS_MASK)
                          | PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;  // pull-up
        for (volatile uint32_t d = 0u; d < 20000u; ++d) {
        }
        uint32_t up = (GPIO3->PDIR & m) != 0u;

        PORT3->PCR[pin] = (PORT3->PCR[pin] & ~(uint32_t)PORT_PCR_PS_MASK)
                          | PORT_PCR_PE_MASK;  // pull-down
        for (volatile uint32_t d = 0u; d < 20000u; ++d) {
        }
        uint32_t dn = (GPIO3->PDIR & m) != 0u;

        PORT3->PCR[pin] &= ~((uint32_t)PORT_PCR_PE_MASK | (uint32_t)PORT_PCR_PS_MASK);

        dbg_puts("  P3_");
        dbg_putc((char)('0' + (pin / 10u)));
        dbg_putc((char)('0' + (pin % 10u)));
        dbg_puts(" pu=");
        dbg_putc(up ? '1' : '0');
        dbg_puts(" pd=");
        dbg_putc(dn ? '1' : '0');
        if (up && !dn) {
            dbg_puts("  -> input works, pin FLOATING (nothing connected)\n");
        } else if (!up && !dn) {
            dbg_puts("  -> held LOW externally, or input dead\n");
        } else if (up && dn) {
            dbg_puts("  -> held HIGH externally\n");
        } else {
            dbg_puts("  -> inconsistent\n");
        }
    }
}
// ---- END WIRE PROBE ----

// ---- BOOT-TIME REGISTER DUMP -- retained deliberately ----

static void link_delay(uint32_t n)
{
    for (volatile uint32_t d = 0u; d < n; ++d) {
    }
}

static void link_show(const char *name, uint32_t value)
{
    dbg_puts("  ");
    dbg_puts(name);
    dbg_puts(" = ");
    dbg_hex32(value);
    dbg_puts("\n");
}

static void link_dump_channel(const char *tag, uint32_t ch)
{
    dbg_puts(tag);
    link_show("CH_CSR       ", LINK_DMA->CH[ch].CH_CSR);
    link_show("CH_ES        ", LINK_DMA->CH[ch].CH_ES);
    link_show("CH_INT       ", LINK_DMA->CH[ch].CH_INT);
    link_show("CH_MUX       ", LINK_DMA->CH[ch].CH_MUX);
    link_show("TCD_SADDR    ", LINK_DMA->CH[ch].TCD_SADDR);
    link_show("TCD_DADDR    ", LINK_DMA->CH[ch].TCD_DADDR);
    link_show("TCD_SOFF     ", (uint32_t)LINK_DMA->CH[ch].TCD_SOFF);
    link_show("TCD_DOFF     ", (uint32_t)LINK_DMA->CH[ch].TCD_DOFF);
    link_show("TCD_NBYTES   ", LINK_DMA->CH[ch].TCD_NBYTES_MLOFFNO);
    link_show("TCD_ATTR     ", (uint32_t)LINK_DMA->CH[ch].TCD_ATTR);
    link_show("TCD_CITER    ", (uint32_t)LINK_DMA->CH[ch].TCD_CITER_ELINKNO);
    link_show("TCD_BITER    ", (uint32_t)LINK_DMA->CH[ch].TCD_BITER_ELINKNO);
    link_show("TCD_DLAST_SGA", LINK_DMA->CH[ch].TCD_DLAST_SGA);
    link_show("TCD_CSR      ", (uint32_t)LINK_DMA->CH[ch].TCD_CSR);
}

